In [1]:
import os
from dotenv import load_dotenv

In [ ]:
load_dotenv()
OPEN_API_KEY = os.getenv("OPEN_API_KEY")

In [ ]:
os.environ["OPEN_API_KEY"] = OPEN_API_KEY

load data

In [4]:
from langchain.document_loaders import PyPDFLoader

In [5]:
#check the working project directory

%pwd

'c:\\Users\\91888\\Desktop\\openAI\\Langchain-AI\\INTERVIEW QUESTION CREATOR\\reasech'

In [6]:
# data is outsiden of directory the use

%cd ..

c:\Users\91888\Desktop\openAI\Langchain-AI\INTERVIEW QUESTION CREATOR

In [7]:
file_path ="data/SQL Notes.pdf"
loader = PyPDFLoader(file_path)
data = loader.load()

In [8]:
data

[Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 0}, page_content='1INTRODUCTION SQL is divided into the followingData Definition Language (DDL) Data Manipulation Language (DML) Data Retrieval Language (DRL) Transaction Control Language (TCL) Data Control Language (DCL)DDL-- create, alter, drop, truncate, renameDML -- insert, update, delete  DRL -- selectTCL -- commit, rollback, savepointDCL-- grant, revoke  CREATE TABLE SYNTAX Create table <table_name> (col1 datatype1, col2 datatype2 …coln datatypen); Ex: SQL>create table student (no number (2), name varchar (10), marks number (3));INSERT This will be used to insert the records into table.We have two methods to insert. By value method By address methoda) USING VALUE METHOD  Syntax: insert into <table_name) values (value1, value2, value3 …. Valuen);  '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 1}, page_content="2Ex:  SQL>insert into student values (1, ’sudha’, 100); SQL>insert into student values (2, ’saketh’, 200); To insert a new record again you have to type entire insert command, if there are lot of  records this will be difficult.This will be avoided by using address method. b) USING ADDRESS METHOD Syntax: insert into <table_name) values (&col1, &col2, &col3 …. &coln); This will prompt you for the values but for every insert you have to use forward slash. Ex: SQL>insert into student values (&no, '&name', &marks); Enter value for no: 1Enter value for name: Jagan Enter value for marks: 300old   1: insert into student values(&no, '&name', &marks)new   1: insert into student values(1, 'Jagan', 300)SQL>/ Enter value for no: 2Enter value for name: NarenEnter value for marks: 400old   1: insert into student values(&no, '&name', &marks)new   1: insert into student values(2, 'Naren', 400)c) INSERTING DATA INTO SPECIFIED COLUMNS USING VALUE METHOD  Syntax: insert into <table_name)(col1, col2, col3 … Coln) values (value1, value2, value3 …. Valuen);"),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 2}, page_content="3Ex:  SQL>insert into student (no, name) values (3, ’Ramesh’);SQL>insert into student (no, name) values (4, ’Madhu’);d) INSERTING DATA INTO SPECIFIED COLUMNS USING ADDRESS METHODSyntax: insert into <table_name)(col1, col2, col3 … coln) values (&col1, &col2, &col3 …. &coln);This will prompt you for the values but for every insert you have to use forward slash. Ex:SQL>insert into student (no, name) values (&no, '&name'); Enter value for no: 5Enter value for name: Visu old   1:  insert into student (no, name) values(&no, '&name') new   1:  insert into student (no, name) values(5, 'Visu')SQL>/ Enter value for no: 6Enter value for name: Rattu old   1:  insert into student (no, name) values(&no, '&name') new   1:  insert into student (no, name) values(6, 'Rattu')SELECTING DATASyntax: Select * from <table_name>; -- here * indicates all columns orSelect col1, col2, … coln from <table_name>;Ex: SQL>select * from student;         NO NAME      MARKS         --- ------ --------"),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 3}, page_content='4         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh 4   Madhu         5   Visu          6   Rattu SQL>select no, name, marks from student;        NO NAME            MARKS         --- ------ --------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL>select no, name from student;        NO NAME         --- -------         1   Sudha         2   Saketh          1   Jagan         2   Naren         3   Ramesh          4   Madhu          5   Visu          6   Rattu '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 4}, page_content='5CONDITIONAL SELECTIONS AND OPERATORS We have two clauses used in thisWhere Order byUSING WHERE  Syntax: select * from <table_name> where <condition>;the following are the different types of operators used in where clause. Arithmetic operators  Comparison operators Logical operators   Arithmetic operators -- highest precedence+, -, *, / Comparison operators =, !=, >, <, >=, <=, <>between, not betweenin, not innull, not nulllike  Logical operators And Or   -- lowest precedencenot a) USING =, >, <, >=, <=, !=, <> Ex:SQL>select * from student where no = 2; '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 5}, page_content='6NO NAME            MARKS  ---  -------           --------- 2   Saketh            200 2   Naren             400 SQL>select * from student where no < 2;NO NAME            MARKS---  -------           ----------1   Sudha             100 1   Jagan             300 SQL>select * from student where no > 2;          NO NAME            MARKS         ---  -------           ----------          3   Ramesh          4   Madhu          5   Visu          6   Rattu  SQL> select * from student where no <= 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren 400 SQL> select * from student where no >= 2;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            200'),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 6}, page_content='7         2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no != 2;         NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan             300          3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no <> 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan          300          3   Ramesh          4   Madhu          5   Visu          6   Rattu b) USING AND This will gives the output when all the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> and .. <conditionn>; '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 7}, page_content='8Ex:SQL> select * from student where no = 2 and marks >= 200;NO NAME            MARKS         ---  -------           --------          2   Saketh            200         2   Naren             400c) USING ORThis will gives the output when either of the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> or .. <conditionn>;Ex: SQL> select * from student where no = 2 or marks >= 200;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan             300          2   Naren             400d) USING BETWEEN This will gives the output based on the column and its lower bound, upperbound.Syntax: select * from <table_name> where <col> between <lower bound> and <upper bound>; Ex: SQL> select * from student where marks between 200 and 400; '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 8}, page_content='9         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan              300 2   Naren              400e) USING NOT BETWEEN This will gives the output based on the column which values are not in its lower bound, upperbound. Syntax: select * from <table_name> where <col> not between <lower bound> and <upper bound>;Ex: SQL> select * from student where marks not between 200 and 400;         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100  f) USING INThis will gives the output based on the column and its list of values specified.Syntax: select * from <table_name> where <col> in (value1, value2, value3 … valuen);Ex: SQL> select * from student where no in (1, 2, 3);          NO NAME            MARKS         --- ------- ---------         1   Sudha             100 '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 9}, page_content='10         2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh g) USING NOT INThis will gives the output  based on the column which values are not in the list of values  specified. Syntax: select * from <table_name> where <col> not in ( value1, value2, value3 … valuen); Ex: SQL> select * from student where no not in (1, 2, 3);           NO NAME            MARKS         ---  -------           ---------         4   Madhu          5   Visu          6   Rattu  h) USING NULLThis will gives the output based on the null values in the specified column. Syntax: select * from <table_name> where <col> is null; Ex: SQL> select * from student where marks is null;         NO NAME            MARKS         ---  -------           ---------         3   Ramesh '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 10}, page_content='11         4   Madhu          5   Visu          6   Rattu  i) USING NOT NULLThis will gives the output based on the not null values in the specified column.Syntax: select * from <table_name> where <col> is not null; Ex:SQL> select * from student where marks is not null;          NO NAME            MARKS         ---  -------           ---------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400 j) USING LIKE This will be used to search through the rows of database column based on the pattern you  specify.Syntax: select * from <table_name> where <col> like <pattern>; Ex:i) This will give the rows whose marks are 100. SQL>select * from student where marks like 100;          NO NAME            MARKS         ---  -------           ---------'),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 11}, page_content="12         1   Sudha             100  ii) This will give the rows whose name start with ‘S’.  SQL>select * from student where name like 'S%';         NO NAME            MARKS         ---  -------    ---------         1   Sudha             100          2   Saketh            200iii) This will give the rows whose name ends with ‘h’. SQL>select * from student where name like '%h';           NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh  iV) This will give the rows whose name’s second letter start with ‘a’.SQL>select * from student where name like '_a%';         NO NAME            MARKS           --- -------            --------          2   Saketh            200          1   Jagan             300           2   Naren             400          3   Ramesh           4   Madhu           6   Rattu V) This will give the rows whose name’s third letter start with ‘d’. "),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 12}, page_content="13SQL>select * from student where name like '__d%';         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100 4   MadhuVi) This will give the rows whose name’s second letter start with ‘t’ from ending.SQL>select * from student where name like '%_t%';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         6   Rattu  Vii) This will give the rows whose name’s third letter start with ‘e’ from ending. SQL>select * from student where name like '%e__%';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh Viii) This will give the rows whose name  cotains 2 a’s.SQL>select * from student where name like '%a% a %';         NO NAME            MARKS          --- -------           ----------          1   Jagan             300 * You have to specify the patterns in like using underscore ( _ )."),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 13}, page_content='14USING ORDER BY This will be used to ordering the columns data (ascending or descending). Syntax: Select * from <table_name> order by <col> desc;By default oracle will use ascending order. If you want output in descending order you have to use desc keyword after the column. Ex: SQL>select * from student order by no;NO NAME            MARKS---  -------           --------- 1   Sudha             100 1   Jagan              300 2   Saketh            200 2   Naren             4003   Ramesh4   Madhu 5   Visu    6   RattuSQL>select * from student order by no desc; NO NAME            MARKS---  -------           --------- 6 Rattu 5 Visu 4 Madhu 3 Ramesh 2 Saketh            2002 Naren             400 1 Sudha             100 1 Jagan             300 '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 14}, page_content="15USING DML  USING UPDATEThis can be used to modify the table data. Syntax: Update <table_name> set <col1> = value1, <col2> = value2 where <condition>;Ex: SQL>update student set marks = 500;If you are not specifying any condition this will update entire table.SQL>update student set marks = 500 where no = 2;SQL>update student set marks = 500, name = 'Venu' where no = 1; USING DELETE This can be used to delete the table data temporarily.Syntax: Delete <table_name> where <condition>; Ex: SQL>delete student;If you are not specifying any condition this will delete entire table. SQL>delete student where no = 2; "),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 15}, page_content='16USING DDLUSING ALTERThis can be used to add or remove columns and to modify the precision of the datatype. a) ADDING COLUMN Syntax: alter table <table_name> add <col datatype>;Ex: SQL>alter table student add sdob date;  b) REMOVING COLUMNSyntax: alter table <table_name> drop <col datatype>; Ex: SQL> alter table student drop column sdob; c) INCREASING OR DECREASING PRECISION OF A COLUMNSyntax: alter table <table_name> modify <col datatype>;Ex: SQL>alter table student modify marks number(5);* To decrease precision the column should be empty.d) MAKING COLUMN UNUSEDSyntax: alter table <table_name> set unused column <col>;'),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 16}, page_content='17Ex: SQL> alter table student set unused column marks; Even though the column is unused still it will occupy memory.d) DROPPING UNUSED COLUMNSSyntax: alter table <table_name> drop unused columns;Ex: SQL>alter table student drop unused columns;   * You can not drop individual unused columns of a table. e) RENAMING COLUMN Syntax: alter table <table_name> rename column <old_col_name> to <new_col_name>;Ex: SQL>alter table student rename column marks to smarks;  USING TRUNCATEThis can be used to delete the entire table data permanently. Syntax: truncate table <table_name>;Ex: SQL>truncate table student; USING DROP  This will be used to drop the database object; '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 17}, page_content='18Syntax: Drop table <table_name>;Ex: SQL>drop table student;USING RENAME This will be used to rename the database object;Syntax: rename <old_table_name> to <new_table_name>;Ex: SQL>rename student to stud;'),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 18}, page_content='19USING TCLUSING COMMITThis will be used to save the work.Commit is of two types. ImplicitExplicit a) IMPLICIT  This will be issued by oracle internally in two situations.When any DDL operation is performed. When you are exiting from SQL * PLUS. b) EXPLICITThis will be issued by the user. Syntax:  Commit or commit work;* When ever you committed then the transaction was completed.USING ROLLBACK This will undo the operation.This will be applied in two methods. Upto previous commitUpto previous rollback Syntax: Roll or roll work; Or  Rollback or rollback work;* While process is going on, if suddenly power goes then oracle will rollback the transaction. '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 19}, page_content='20USING SAVEPOINT You can use savepoints to rollback portions of your current set of transactions. Syntax: Savepoint <savepoint_name>;Ex: SQL>savepoint s1;SQL>insert into student values(1, ‘a’, 100); SQL>savepoint s2;SQL>insert into student values(2, ‘b’, 200); SQL>savepoint s3;SQL> insert into student values(3, ‘c’, 300); SQL>savepoint s4;SQL> insert into student values(4, ‘d’, 400); Before rollback SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100          2  b         200         3  c         300          4  d         400SQL>rollback to savepoint s3;  Or SQL>rollback to s3;  This will rollback last two records. '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 20}, page_content='21SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100 2 b         200'),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 21}, page_content='22USING DCLDCL commands are used to granting and revoking the permissions. USING GRANTThis is used to grant the privileges to other users.Syntax: Grant <privileges> on <object_name> to <user_name> [with grant option]; Ex: SQL>grant select on student to sudha;-- you can give individual privilege SQL> grant select, insert on student to sudha; -- you can give set of privilegesSQL>grant all on student to sudha;  -- you can give all privileges  The sudha user has to use dot method to access the object.SQL>select * from saketh.student; The sudha user can not grant permission on student table to other users. To get this type of option use the following.SQL>grant all on student to sudha with grant option;  Now sudha user also grant permissions on student table. USING REVOKEThis is used to revoke the privileges from the users to which you granted the privileges. Syntax: Revoke <privileges> on <object_name> from <user_name>; Ex: SQL>revoke select on student form sudha; -- you can revoke individual privilegeSQL>revoke select, insert on student from sudha;-- you can revoke set of privilegesSQL> revoke all on student from sudha; -- you can revoke all privileges '),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 22}, page_content='23USING ALIASESCREATE WITH SELECT We can create a table using existing table [along with data].Syntax: Create table <new_table_name> [col1, col2, col3 ... coln] as select * from  <old_table_name>;Ex: SQL>create table student1 as select * from student; Creating table with your own column names.SQL>create table student2(sno, sname, smarks) as select * from student; Creating table with specified columns.SQL>create table student3 as select no,name from student;  Creating table with out table data. SQL>create table student2(sno, sname, smarks) as select * from student where 1 = 2; In the above where clause give any condition which does not satisfy. INSERT WITH SELECTUsing this we can insert existing table data to a another table in a single trip. But the table structure should be same. Syntax: Insert into <table1> select * from <table2>;     Ex: SQL>insert into student1 select * from student;Inserting data into specified columnsSQL>insert into student1(no, name) select no, name from student;'),
 Document(metadata={'source': 'data/SQL Notes.pdf', 'page': 23}, page_content='24COLUMN ALIASES Syntax: Select <orginal_col> <alias_name> from <table_name>;Ex:SQL>select no sno from student;orSQL>select no “sno” from student;TABLE ALIASES If you are using table aliases you can use dot method to the columns. Syntax: Select <alias_name>.<col1>, <alias_name>.<col2> … <alias_name>.<coln> from <table_name> <alias_name>; Ex: SQL>select s.no, s.name from student s;'),

In [9]:
len(data)

160

In [10]:
# seprate seprate variable wantb  tp store data in one variable

question_gen = ""

for page in data:
    question_gen += page.page_content

In [11]:
question_gen

'1INTRODUCTION SQL is divided into the followingData Definition Language (DDL) Data Manipulation Language (DML) Data Retrieval Language (DRL) Transaction Control Language (TCL) Data Control Language (DCL)DDL-- create, alter, drop, truncate, renameDML -- insert, update, delete  DRL -- selectTCL -- commit, rollback, savepointDCL-- grant, revoke  CREATE TABLE SYNTAX Create table <table_name> (col1 datatype1, col2 datatype2 …coln datatypen); Ex: SQL>create table student (no number (2), name varchar (10), marks number (3));INSERT This will be used to insert the records into table.We have two methods to insert. By value method By address methoda) USING VALUE METHOD  Syntax: insert into <table_name) values (value1, value2, value3 …. Valuen);  2Ex:  SQL>insert into student values (1, ’sudha’, 100); SQL>insert into student values (2, ’saketh’, 200); To insert a new record again you have to type entire insert command, if there are lot of  records this will be difficult.This will be avoided by using address method. b) USING ADDRESS METHOD Syntax: insert into <table_name) values (&col1, &col2, &col3 …. &coln); This will prompt you for the values but for every insert you have to use forward slash. Ex: SQL>insert into student values (&no, \'&name\', &marks); Enter value for no: 1Enter value for name: Jagan Enter value for marks: 300old   1: insert into student values(&no, \'&name\', &marks)new   1: insert into student values(1, \'Jagan\', 300)SQL>/ Enter value for no: 2Enter value for name: NarenEnter value for marks: 400old   1: insert into student values(&no, \'&name\', &marks)new   1: insert into student values(2, \'Naren\', 400)c) INSERTING DATA INTO SPECIFIED COLUMNS USING VALUE METHOD  Syntax: insert into <table_name)(col1, col2, col3 … Coln) values (value1, value2, value3 …. Valuen);3Ex:  SQL>insert into student (no, name) values (3, ’Ramesh’);SQL>insert into student (no, name) values (4, ’Madhu’);d) INSERTING DATA INTO SPECIFIED COLUMNS USING ADDRESS METHODSyntax: insert into <table_name)(col1, col2, col3 … coln) values (&col1, &col2, &col3 …. &coln);This will prompt you for the values but for every insert you have to use forward slash. Ex:SQL>insert into student (no, name) values (&no, \'&name\'); Enter value for no: 5Enter value for name: Visu old   1:  insert into student (no, name) values(&no, \'&name\') new   1:  insert into student (no, name) values(5, \'Visu\')SQL>/ Enter value for no: 6Enter value for name: Rattu old   1:  insert into student (no, name) values(&no, \'&name\') new   1:  insert into student (no, name) values(6, \'Rattu\')SELECTING DATASyntax: Select * from <table_name>; -- here * indicates all columns orSelect col1, col2, … coln from <table_name>;Ex: SQL>select * from student;         NO NAME      MARKS         --- ------ --------4         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh 4   Madhu         5   Visu          6   Rattu SQL>select no, name, marks from student;        NO NAME            MARKS         --- ------ --------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL>select no, name from student;        NO NAME         --- -------         1   Sudha         2   Saketh          1   Jagan         2   Naren         3   Ramesh          4   Madhu          5   Visu          6   Rattu 5CONDITIONAL SELECTIONS AND OPERATORS We have two clauses used in thisWhere Order byUSING WHERE  Syntax: select * from <table_name> where <condition>;the following are the different types of operators used in where clause. Arithmetic operators  Comparison operators Logical operators   Arithmetic operators -- highest precedence+, -, *, / Comparison operators =, !=, >, <, >=, <=, <>between, not betweenin, not innull, not nulllike  Logical operators And Or   -- lowest precedencenot a) USING =, >, <, >=, <=, !=, <> Ex:SQL>select * from student where no = 2; 6NO NAME            MARKS  ---  -------           --------- 2   Saketh            200 2   Naren             400 SQL>select * from student where no < 2;NO NAME            MARKS---  -------           ----------1   Sudha             100 1   Jagan             300 SQL>select * from student where no > 2;          NO NAME            MARKS         ---  -------           ----------          3   Ramesh          4   Madhu          5   Visu          6   Rattu  SQL> select * from student where no <= 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren 400 SQL> select * from student where no >= 2;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            2007         2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no != 2;         NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan             300          3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no <> 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan          300          3   Ramesh          4   Madhu          5   Visu          6   Rattu b) USING AND This will gives the output when all the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> and .. <conditionn>; 8Ex:SQL> select * from student where no = 2 and marks >= 200;NO NAME            MARKS         ---  -------           --------          2   Saketh            200         2   Naren             400c) USING ORThis will gives the output when either of the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> or .. <conditionn>;Ex: SQL> select * from student where no = 2 or marks >= 200;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan             300          2   Naren             400d) USING BETWEEN This will gives the output based on the column and its lower bound, upperbound.Syntax: select * from <table_name> where <col> between <lower bound> and <upper bound>; Ex: SQL> select * from student where marks between 200 and 400; 9         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan              300 2   Naren              400e) USING NOT BETWEEN This will gives the output based on the column which values are not in its lower bound, upperbound. Syntax: select * from <table_name> where <col> not between <lower bound> and <upper bound>;Ex: SQL> select * from student where marks not between 200 and 400;         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100  f) USING INThis will gives the output based on the column and its list of values specified.Syntax: select * from <table_name> where <col> in (value1, value2, value3 … valuen);Ex: SQL> select * from student where no in (1, 2, 3);          NO NAME            MARKS         --- ------- ---------         1   Sudha             100 10         2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh g) USING NOT INThis will gives the output  based on the column which values are not in the list of values  specified. Syntax: select * from <table_name> where <col> not in ( value1, value2, value3 … valuen); Ex: SQL> select * from student where no not in (1, 2, 3);           NO NAME            MARKS         ---  -------           ---------         4   Madhu          5   Visu          6   Rattu  h) USING NULLThis will gives the output based on the null values in the specified column. Syntax: select * from <table_name> where <col> is null; Ex: SQL> select * from student where marks is null;         NO NAME            MARKS         ---  -------           ---------         3   Ramesh 11         4   Madhu          5   Visu          6   Rattu  i) USING NOT NULLThis will gives the output based on the not null values in the specified column.Syntax: select * from <table_name> where <col> is not null; Ex:SQL> select * from student where marks is not null;          NO NAME            MARKS         ---  -------           ---------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400 j) USING LIKE This will be used to search through the rows of database column based on the pattern you  specify.Syntax: select * from <table_name> where <col> like <pattern>; Ex:i) This will give the rows whose marks are 100. SQL>select * from student where marks like 100;          NO NAME            MARKS         ---  -------           ---------12         1   Sudha             100  ii) This will give the rows whose name start with ‘S’.  SQL>select * from student where name like \'S%\';         NO NAME            MARKS         ---  -------    ---------         1   Sudha             100          2   Saketh            200iii) This will give the rows whose name ends with ‘h’. SQL>select * from student where name like \'%h\';           NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh  iV) This will give the rows whose name’s second letter start with ‘a’.SQL>select * from student where name like \'_a%\';         NO NAME            MARKS           --- -------            --------          2   Saketh            200          1   Jagan             300           2   Naren             400          3   Ramesh           4   Madhu           6   Rattu V) This will give the rows whose name’s third letter start with ‘d’. 13SQL>select * from student where name like \'__d%\';         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100 4   MadhuVi) This will give the rows whose name’s second letter start with ‘t’ from ending.SQL>select * from student where name like \'%_t%\';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         6   Rattu  Vii) This will give the rows whose name’s third letter start with ‘e’ from ending. SQL>select * from student where name like \'%e__%\';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh Viii) This will give the rows whose name  cotains 2 a’s.SQL>select * from student where name like \'%a% a %\';         NO NAME            MARKS          --- -------           ----------          1   Jagan             300 * You have to specify the patterns in like using underscore ( _ ).14USING ORDER BY This will be used to ordering the columns data (ascending or descending). Syntax: Select * from <table_name> order by <col> desc;By default oracle will use ascending order. If you want output in descending order you have to use desc keyword after the column. Ex: SQL>select * from student order by no;NO NAME            MARKS---  -------           --------- 1   Sudha             100 1   Jagan              300 2   Saketh            200 2   Naren             4003   Ramesh4   Madhu 5   Visu    6   RattuSQL>select * from student order by no desc; NO NAME            MARKS---  -------           --------- 6 Rattu 5 Visu 4 Madhu 3 Ramesh 2 Saketh            2002 Naren             400 1 Sudha             100 1 Jagan             300 15USING DML  USING UPDATEThis can be used to modify the table data. Syntax: Update <table_name> set <col1> = value1, <col2> = value2 where <condition>;Ex: SQL>update student set marks = 500;If you are not specifying any condition this will update entire table.SQL>update student set marks = 500 where no = 2;SQL>update student set marks = 500, name = \'Venu\' where no = 1; USING DELETE This can be used to delete the table data temporarily.Syntax: Delete <table_name> where <condition>; Ex: SQL>delete student;If you are not specifying any condition this will delete entire table. SQL>delete student where no = 2; 16USING DDLUSING ALTERThis can be used to add or remove columns and to modify the precision of the datatype. a) ADDING COLUMN Syntax: alter table <table_name> add <col datatype>;Ex: SQL>alter table student add sdob date;  b) REMOVING COLUMNSyntax: alter table <table_name> drop <col datatype>; Ex: SQL> alter table student drop column sdob; c) INCREASING OR DECREASING PRECISION OF A COLUMNSyntax: alter table <table_name> modify <col datatype>;Ex: SQL>alter table student modify marks number(5);* To decrease precision the column should be empty.d) MAKING COLUMN UNUSEDSyntax: alter table <table_name> set unused column <col>;17Ex: SQL> alter table student set unused column marks; Even though the column is unused still it will occupy memory.d) DROPPING UNUSED COLUMNSSyntax: alter table <table_name> drop unused columns;Ex: SQL>alter table student drop unused columns;   * You can not drop individual unused columns of a table. e) RENAMING COLUMN Syntax: alter table <table_name> rename column <old_col_name> to <new_col_name>;Ex: SQL>alter table student rename column marks to smarks;  USING TRUNCATEThis can be used to delete the entire table data permanently. Syntax: truncate table <table_name>;Ex: SQL>truncate table student; USING DROP  This will be used to drop the database object; 18Syntax: Drop table <table_name>;Ex: SQL>drop table student;USING RENAME This will be used to rename the database object;Syntax: rename <old_table_name> to <new_table_name>;Ex: SQL>rename student to stud;19USING TCLUSING COMMITThis will be used to save the work.Commit is of two types. ImplicitExplicit a) IMPLICIT  This will be issued by oracle internally in two situations.When any DDL operation is performed. When you are exiting from SQL * PLUS. b) EXPLICITThis will be issued by the user. Syntax:  Commit or commit work;* When ever you committed then the transaction was completed.USING ROLLBACK This will undo the operation.This will be applied in two methods. Upto previous commitUpto previous rollback Syntax: Roll or roll work; Or  Rollback or rollback work;* While process is going on, if suddenly power goes then oracle will rollback the transaction. 20USING SAVEPOINT You can use savepoints to rollback portions of your current set of transactions. Syntax: Savepoint <savepoint_name>;Ex: SQL>savepoint s1;SQL>insert into student values(1, ‘a’, 100); SQL>savepoint s2;SQL>insert into student values(2, ‘b’, 200); SQL>savepoint s3;SQL> insert into student values(3, ‘c’, 300); SQL>savepoint s4;SQL> insert into student values(4, ‘d’, 400); Before rollback SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100          2  b         200         3  c         300          4  d         400SQL>rollback to savepoint s3;  Or SQL>rollback to s3;  This will rollback last two records. 21SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100 2 b         20022USING DCLDCL commands are used to granting and revoking the permissions. USING GRANTThis is used to grant the privileges to other users.Syntax: Grant <privileges> on <object_name> to <user_name> [with grant option]; Ex: SQL>grant select on student to sudha;-- you can give individual privilege SQL> grant select, insert on student to sudha; -- you can give set of privilegesSQL>grant all on student to sudha;  -- you can give all privileges  The sudha user has to use dot method to access the object.SQL>select * from saketh.student; The sudha user can not grant permission on student table to other users. To get this type of option use the following.SQL>grant all on student to sudha with grant option;  Now sudha user also grant permissions on student table. USING REVOKEThis is used to revoke the privileges from the users to which you granted the privileges. Syntax: Revoke <privileges> on <object_name> from <user_name>; Ex: SQL>revoke select on student form sudha; -- you can revoke individual privilegeSQL>revoke select, insert on student from sudha;-- you can revoke set of privilegesSQL> revoke all on student from sudha; -- you can revoke all privileges 23USING ALIASESCREATE WITH SELECT We can create a table using existing table [along with data].Syntax: Create table <new_table_name> [col1, col2, col3 ... coln] as select * from  <old_table_name>;Ex: SQL>create table student1 as select * from student; Creating table with your own column names.SQL>create table student2(sno, sname, smarks) as select * from student; Creating table with specified columns.SQL>create table student3 as select no,name from student;  Creating table with out table data. SQL>create table student2(sno, sname, smarks) as select * from student where 1 = 2; In the above where clause give any condition which does not satisfy. INSERT WITH SELECTUsing this we can insert existing table data to a another table in a single trip. But the table structure should be same. Syntax: Insert into <table1> select * from <table2>;     Ex: SQL>insert into student1 select * from student;Inserting data into specified columnsSQL>insert into student1(no, name) select no, name from student;24COLUMN ALIASES Syntax: Select <orginal_col> <alias_name> from <table_name>;Ex:SQL>select no sno from student;orSQL>select no “sno” from student;TABLE ALIASES If you are using table aliases you can use dot method to the columns. Syntax: Select <alias_name>.<col1>, <alias_name>.<col2> … <alias_name>.<coln> from <table_name> <alias_name>; Ex: SQL>select s.no, s.name from student s;25USING MERGEMERGE You can use merge command to perform insert and update in a single command. Ex: SQL>Merge into student1 s1 Using (select *From student2) s2 On(s1.no=s2.no)When matched then Update set marks = s2.marksWhen not matched thenInsert (s1.no,s1.name,s1.marks) Values(s2.no,s2.name,s2.marks); In the above the two tables are with the same structure but we can merge different structured     tables also but the datatype of the columns should match.Assume that student1 has columns like no,name,marks and student2 has columns like no,        name, hno, city. SQL>Merge into student1 s1 Using (select *From student2) s2 On(s1.no=s2.no)When matched then Update set marks = s2.hno When not matched thenInsert (s1.no,s1.name,s1.marks) Values(s2.no,s2.name,s2.hno);26MULTIBLE INSERTSWe have table called DEPT with the following columns and dataDEPTNO DNAME LOC -------- -------- ----10 accounting new york 20 research dallas30 sales   Chicago 40 operations bostona) CREATE STUDENT TABLE SQL>Create table student(no number(2),name varchar(2),marks number(3)); b) MULTI INSERT WITH ALL FIELDS SQL>Insert all Into student values(1,’a’,100)Into student values(2,’b’,200) Into student values(3,’c’,300) Select *from dept where deptno=10;-- This inserts 3 rows c) MULTI INSERT WITH SPECIFIED FIELDSSQL>insert all Into student (no,name) values(4,’d’)Into student(name,marks) values(’e’,400)Into student values(3,’c’,300) Select *from dept where deptno=10;-- This inserts 3 rows 27d) MULTI INSERT WITH DUPLICATE ROWSSQL>insert all Into student values(1,’a’,100)Into student values(2,’b’,200) Into student values(3,’c’,300) Select *from dept where deptno > 10;-- This inserts 9 rows because in the select statement retrieves 3 records (3 inserts for each     row retrieved)e) MULTI INSERT WITH CONDITIONS BASEDSQL>Insert all When deptno > 10 thenInto student1 values(1,’a’,100)When dname = ‘SALES’ then Into student2 values(2,’b’,200)When loc = ‘NEW  YORK’ then Into student3 values(3,’c’,300) Select *from dept where deptno>10;-- This  inserts 4 rows because the first co

# data loading completed

**now chunking opration**

In [12]:
from langchain.text_splitter import TokenTextSplitter

In [16]:
# toekntextspillter use model like gpt fro chunking

splitter_ques_gen = TokenTextSplitter(
    model_name ="gpt-3.5-turbo",
    chunk_size =10000,
    chunk_overlap = 200
)

In [17]:
chunk_ques_gen = splitter_ques_gen.split_text(question_gen)

In [18]:
chunk_ques_gen

["1INTRODUCTION SQL is divided into the followingData Definition Language (DDL) Data Manipulation Language (DML) Data Retrieval Language (DRL) Transaction Control Language (TCL) Data Control Language (DCL)DDL-- create, alter, drop, truncate, renameDML -- insert, update, delete  DRL -- selectTCL -- commit, rollback, savepointDCL-- grant, revoke  CREATE TABLE SYNTAX Create table <table_name> (col1 datatype1, col2 datatype2 …coln datatypen); Ex: SQL>create table student (no number (2), name varchar (10), marks number (3));INSERT This will be used to insert the records into table.We have two methods to insert. By value method By address methoda) USING VALUE METHOD  Syntax: insert into <table_name) values (value1, value2, value3 …. Valuen);  2Ex:  SQL>insert into student values (1, ’sudha’, 100); SQL>insert into student values (2, ’saketh’, 200); To insert a new record again you have to type entire insert command, if there are lot of  records this will be difficult.This will be avoided by using address method. b) USING ADDRESS METHOD Syntax: insert into <table_name) values (&col1, &col2, &col3 …. &coln); This will prompt you for the values but for every insert you have to use forward slash. Ex: SQL>insert into student values (&no, '&name', &marks); Enter value for no: 1Enter value for name: Jagan Enter value for marks: 300old   1: insert into student values(&no, '&name', &marks)new   1: insert into student values(1, 'Jagan', 300)SQL>/ Enter value for no: 2Enter value for name: NarenEnter value for marks: 400old   1: insert into student values(&no, '&name', &marks)new   1: insert into student values(2, 'Naren', 400)c) INSERTING DATA INTO SPECIFIED COLUMNS USING VALUE METHOD  Syntax: insert into <table_name)(col1, col2, col3 … Coln) values (value1, value2, value3 …. Valuen);3Ex:  SQL>insert into student (no, name) values (3, ’Ramesh’);SQL>insert into student (no, name) values (4, ’Madhu’);d) INSERTING DATA INTO SPECIFIED COLUMNS USING ADDRESS METHODSyntax: insert into <table_name)(col1, col2, col3 … coln) values (&col1, &col2, &col3 …. &coln);This will prompt you for the values but for every insert you have to use forward slash. Ex:SQL>insert into student (no, name) values (&no, '&name'); Enter value for no: 5Enter value for name: Visu old   1:  insert into student (no, name) values(&no, '&name') new   1:  insert into student (no, name) values(5, 'Visu')SQL>/ Enter value for no: 6Enter value for name: Rattu old   1:  insert into student (no, name) values(&no, '&name') new   1:  insert into student (no, name) values(6, 'Rattu')SELECTING DATASyntax: Select * from <table_name>; -- here * indicates all columns orSelect col1, col2, … coln from <table_name>;Ex: SQL>select * from student;         NO NAME      MARKS         --- ------ --------4         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh 4   Madhu         5   Visu          6   Rattu SQL>select no, name, marks from student;        NO NAME            MARKS         --- ------ --------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL>select no, name from student;        NO NAME         --- -------         1   Sudha         2   Saketh          1   Jagan         2   Naren         3   Ramesh          4   Madhu          5   Visu          6   Rattu 5CONDITIONAL SELECTIONS AND OPERATORS We have two clauses used in thisWhere Order byUSING WHERE  Syntax: select * from <table_name> where <condition>;the following are the different types of operators used in where clause. Arithmetic operators  Comparison operators Logical operators   Arithmetic operators -- highest precedence+, -, *, / Comparison operators =, !=, >, <, >=, <=, <>between, not betweenin, not innull, not nulllike  Logical operators And Or   -- lowest precedencenot a) USING =, >, <, >=, <=, !=, <> Ex:SQL>select * from student where no = 2; 6NO NAME            MARKS  ---  -------           --------- 2   Saketh            200 2   Naren             400 SQL>select * from student where no < 2;NO NAME            MARKS---  -------           ----------1   Sudha             100 1   Jagan             300 SQL>select * from student where no > 2;          NO NAME            MARKS         ---  -------           ----------          3   Ramesh          4   Madhu          5   Visu          6   Rattu  SQL> select * from student where no <= 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren 400 SQL> select * from student where no >= 2;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            2007         2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no != 2;         NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan             300          3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no <> 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan          300          3   Ramesh          4   Madhu          5   Visu          6   Rattu b) USING AND This will gives the output when all the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> and .. <conditionn>; 8Ex:SQL> select * from student where no = 2 and marks >= 200;NO NAME            MARKS         ---  -------           --------          2   Saketh            200         2   Naren             400c) USING ORThis will gives the output when either of the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> or .. <conditionn>;Ex: SQL> select * from student where no = 2 or marks >= 200;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan             300          2   Naren             400d) USING BETWEEN This will gives the output based on the column and its lower bound, upperbound.Syntax: select * from <table_name> where <col> between <lower bound> and <upper bound>; Ex: SQL> select * from student where marks between 200 and 400; 9         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan              300 2   Naren              400e) USING NOT BETWEEN This will gives the output based on the column which values are not in its lower bound, upperbound. Syntax: select * from <table_name> where <col> not between <lower bound> and <upper bound>;Ex: SQL> select * from student where marks not between 200 and 400;         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100  f) USING INThis will gives the output based on the column and its list of values specified.Syntax: select * from <table_name> where <col> in (value1, value2, value3 … valuen);Ex: SQL> select * from student where no in (1, 2, 3);          NO NAME            MARKS         --- ------- ---------         1   Sudha             100 10         2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh g) USING NOT INThis will gives the output  based on the column which values are not in the list of values  specified. Syntax: select * from <table_name> where <col> not in ( value1, value2, value3 … valuen); Ex: SQL> select * from student where no not in (1, 2, 3);           NO NAME            MARKS         ---  -------           ---------         4   Madhu          5   Visu          6   Rattu  h) USING NULLThis will gives the output based on the null values in the specified column. Syntax: select * from <table_name> where <col> is null; Ex: SQL> select * from student where marks is null;         NO NAME            MARKS         ---  -------           ---------         3   Ramesh 11         4   Madhu          5   Visu          6   Rattu  i) USING NOT NULLThis will gives the output based on the not null values in the specified column.Syntax: select * from <table_name> where <col> is not null; Ex:SQL> select * from student where marks is not null;          NO NAME            MARKS         ---  -------           ---------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400 j) USING LIKE This will be used to search through the rows of database column based on the pattern you  specify.Syntax: select * from <table_name> where <col> like <pattern>; Ex:i) This will give the rows whose marks are 100. SQL>select * from student where marks like 100;          NO NAME            MARKS         ---  -------           ---------12         1   Sudha             100  ii) This will give the rows whose name start with ‘S’.  SQL>select * from student where name like 'S%';         NO NAME            MARKS         ---  -------    ---------         1   Sudha             100          2   Saketh            200iii) This will give the rows whose name ends with ‘h’. SQL>select * from student where name like '%h';           NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh  iV) This will give the rows whose name’s second letter start with ‘a’.SQL>select * from student where name like '_a%';         NO NAME            MARKS           --- -------            --------          2   Saketh            200          1   Jagan             300           2   Naren             400          3   Ramesh           4   Madhu           6   Rattu V) This will give the rows whose name’s third letter start with ‘d’. 13SQL>select * from student where name like '__d%';         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100 4   MadhuVi) This will give the rows whose name’s second letter start with ‘t’ from ending.SQL>select * from student where name like '%_t%';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         6   Rattu  Vii) This will give the rows whose name’s third letter start with ‘e’ from ending. SQL>select * from student where name like '%e__%';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh Viii) This will give the rows whose name  cotains 2 a’s.SQL>select * from student where name like '%a% a %';         NO NAME            MARKS          --- -------           ----------          1   Jagan             300 * You have to specify the patterns in like using underscore ( _ ).14USING ORDER BY This will be used to ordering the columns data (ascending or descending). Syntax: Select * from <table_name> order by <col> desc;By default oracle will use ascending order. If you want output in descending order you have to use desc keyword after the column. Ex: SQL>select * from student order by no;NO NAME            MARKS---  -------           --------- 1   Sudha             100 1   Jagan              300 2   Saketh            200 2   Naren             4003   Ramesh4   Madhu 5   Visu    6   RattuSQL>select * from student order by no desc; NO NAME            MARKS---  -------           --------- 6 Rattu 5 Visu 4 Madhu 3 Ramesh 2 Saketh            2002 Naren             400 1 Sudha             100 1 Jagan             300 15USING DML  USING UPDATEThis can be used to modify the table data. Syntax: Update <table_name> set <col1> = value1, <col2> = value2 where <condition>;Ex: SQL>update student set marks = 500;If you are not specifying any condition this will update entire table.SQL>update student set marks = 500 where no = 2;SQL>update student set marks = 500, name = 'Venu' where no = 1; USING DELETE This can be used to delete the table data temporarily.Syntax: Delete <table_name> where <condition>; Ex: SQL>delete student;If you are not specifying any condition this will delete entire table. SQL>delete student where no = 2; 16USING DDLUSING ALTERThis can be used to add or remove columns and to modify the precision of the datatype. a) ADDING COLUMN Syntax: alter table <table_name> add <col datatype>;Ex: SQL>alter table student add sdob date;  b) REMOVING COLUMNSyntax: alter table <table_name> drop <col datatype>; Ex: SQL> alter table student drop column sdob; c) INCREASING OR DECREASING PRECISION OF A COLUMNSyntax: alter table <table_name> modify <col datatype>;Ex: SQL>alter table student modify marks number(5);* To decrease precision the column should be empty.d) MAKING COLUMN UNUSEDSyntax: alter table <table_name> set unused column <col>;17Ex: SQL> alter table student set unused column marks; Even though the column is unused still it will occupy memory.d) DROPPING UNUSED COLUMNSSyntax: alter table <table_name> drop unused columns;Ex: SQL>alter table student drop unused columns;   * You can not drop individual unused columns of a table. e) RENAMING COLUMN Syntax: alter table <table_name> rename column <old_col_name> to <new_col_name>;Ex: SQL>alter table student rename column marks to smarks;  USING TRUNCATEThis can be used to delete the entire table data permanently. Syntax: truncate table <table_name>;Ex: SQL>truncate table student; USING DROP  This will be used to drop the database object; 18Syntax: Drop table <table_name>;Ex: SQL>drop table student;USING RENAME This will be used to rename the database object;Syntax: rename <old_table_name> to <new_table_name>;Ex: SQL>rename student to stud;19USING TCLUSING COMMITThis will be used to save the work.Commit is of two types. ImplicitExplicit a) IMPLICIT  This will be issued by oracle internally in two situations.When any DDL operation is performed. When you are exiting from SQL * PLUS. b) EXPLICITThis will be issued by the user. Syntax:  Commit or commit work;* When ever you committed then the transaction was completed.USING ROLLBACK This will undo the operation.This will be applied in two methods. Upto previous commitUpto previous rollback Syntax: Roll or roll work; Or  Rollback or rollback work;* While process is going on, if suddenly power goes then oracle will rollback the transaction. 20USING SAVEPOINT You can use savepoints to rollback portions of your current set of transactions. Syntax: Savepoint <savepoint_name>;Ex: SQL>savepoint s1;SQL>insert into student values(1, ‘a’, 100); SQL>savepoint s2;SQL>insert into student values(2, ‘b’, 200); SQL>savepoint s3;SQL> insert into student values(3, ‘c’, 300); SQL>savepoint s4;SQL> insert into student values(4, ‘d’, 400); Before rollback SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100          2  b         200         3  c         300          4  d         400SQL>rollback to savepoint s3;  Or SQL>rollback to s3;  This will rollback last two records. 21SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100 2 b         20022USING DCLDCL commands are used to granting and revoking the permissions. USING GRANTThis is used to grant the privileges to other users.Syntax: Grant <privileges> on <object_name> to <user_name> [with grant option]; Ex: SQL>grant select on student to sudha;-- you can give individual privilege SQL> grant select, insert on student to sudha; -- you can give set of privilegesSQL>grant all on student to sudha;  -- you can give all privileges  The sudha user has to use dot method to access the object.SQL>select * from saketh.student; The sudha user can not grant permission on student table to other users. To get this type of option use the following.SQL>grant all on student to sudha with grant option;  Now sudha user also grant permissions on student table. USING REVOKEThis is used to revoke the privileges from the users to which you granted the privileges. Syntax: Revoke <privileges> on <object_name> from <user_name>; Ex: SQL>revoke select on student form sudha; -- you can revoke individual privilegeSQL>revoke select, insert on student from sudha;-- you can revoke set of privilegesSQL> revoke all on student from sudha; -- you can revoke all privileges 23USING ALIASESCREATE WITH SELECT We can create a table using existing table [along with data].Syntax: Create table <new_table_name> [col1, col2, col3 ... coln] as select * from  <old_table_name>;Ex: SQL>create table student1 as select * from student; Creating table with your own column names.SQL>create table student2(sno, sname, smarks) as select * from student; Creating table with specified columns.SQL>create table student3 as select no,name from student;  Creating table with out table data. SQL>create table student2(sno, sname, smarks) as select * from student where 1 = 2; In the above where clause give any condition which does not satisfy. INSERT WITH SELECTUsing this we can insert existing table data to a another table in a single trip. But the table structure should be same. Syntax: Insert into <table1> select * from <table2>;     Ex: SQL>insert into student1 select * from student;Inserting data into specified columnsSQL>insert into student1(no, name) select no, name from student;24COLUMN ALIASES Syntax: Select <orginal_col> <alias_name> from <table_name>;Ex:SQL>select no sno from student;orSQL>select no “sno” from student;TABLE ALIASES If you are using table aliases you can use dot method to the columns. Syntax: Select <alias_name>.<col1>, <alias_name>.<col2> … <alias_name>.<coln> from <table_name> <alias_name>; Ex: SQL>select s.no, s.name from student s;25USING MERGEMERGE You can use merge command to perform insert and update in a single command. Ex: SQL>Merge into student1 s1 Using (select *From student2) s2 On(s1.no=s2.no)When matched then Update set marks = s2.marksWhen not matched thenInsert (s1.no,s1.name,s1.marks) Values(s2.no,s2.name,s2.marks); In the above the two tables are with the same structure but we can merge different structured     tables also but the datatype of the columns should match.Assume that student1 has columns like no,name,marks and student2 has columns like no,        name, hno, city. SQL>Merge into student1 s1 Using (select *From student2) s2 On(s1.no=s2.no)When matched then Update set marks = s2.hno When not matched thenInsert (s1.no,s1.name,s1.marks) Values(s2.no,s2.name,s2.hno);26MULTIBLE INSERTSWe have table called DEPT with the following columns and dataDEPTNO DNAME LOC -------- -------- ----10 accounting new york 20 research dallas30 sales   Chicago 40 operations bostona) CREATE STUDENT TABLE SQL>Create table student(no number(2),name varchar(2),marks number(3)); b) MULTI INSERT WITH ALL FIELDS SQL>Insert all Into student values(1,’a’,100)Into student values(2,’b’,200) Into student values(3,’c’,300) Select *from dept where deptno=10;-- This inserts 3 rows c) MULTI INSERT WITH SPECIFIED FIELDSSQL>insert all Into student (no,name) values(4,’d’)Into student(name,marks) values(’e’,400)Into student values(3,’c’,300) Select *from dept where deptno=10;-- This inserts 3 rows 27d) MULTI INSERT WITH DUPLICATE ROWSSQL>insert all Into student values(1,’a’,100)Into student values(2,’b’,200) Into student values(3,’c’,300) Select *from dept where deptno > 10;-- This inserts 9 rows because in the select statement retrieves 3 records (3 inserts for each     row retrieved)e) MULTI INSERT WITH CONDITIONS BASEDSQL>Insert all When deptno > 10 thenInto student1 values(1,’a’,100)When dname = ‘SALES’ then Into student2 values(2,’b’,200)When loc = ‘NEW  YORK’ then Into student3 values(3,’c’,300) Select *from dept where deptno>10;-- This  inserts 4 rows because the first condition satisfied 3 times, second c

In [19]:
len(chunk_ques_gen)

4

In [20]:
type(chunk_ques_gen[0])

str

**we want to convert in document**

In [21]:
from langchain.docstore.document import Document

In [22]:
document_ques_gen = [Document(page_content = t) for t in chunk_ques_gen]

In [23]:
document_ques_gen

[Document(page_content="1INTRODUCTION SQL is divided into the followingData Definition Language (DDL) Data Manipulation Language (DML) Data Retrieval Language (DRL) Transaction Control Language (TCL) Data Control Language (DCL)DDL-- create, alter, drop, truncate, renameDML -- insert, update, delete  DRL -- selectTCL -- commit, rollback, savepointDCL-- grant, revoke  CREATE TABLE SYNTAX Create table <table_name> (col1 datatype1, col2 datatype2 …coln datatypen); Ex: SQL>create table student (no number (2), name varchar (10), marks number (3));INSERT This will be used to insert the records into table.We have two methods to insert. By value method By address methoda) USING VALUE METHOD  Syntax: insert into <table_name) values (value1, value2, value3 …. Valuen);  2Ex:  SQL>insert into student values (1, ’sudha’, 100); SQL>insert into student values (2, ’saketh’, 200); To insert a new record again you have to type entire insert command, if there are lot of  records this will be difficult.This will be avoided by using address method. b) USING ADDRESS METHOD Syntax: insert into <table_name) values (&col1, &col2, &col3 …. &coln); This will prompt you for the values but for every insert you have to use forward slash. Ex: SQL>insert into student values (&no, '&name', &marks); Enter value for no: 1Enter value for name: Jagan Enter value for marks: 300old   1: insert into student values(&no, '&name', &marks)new   1: insert into student values(1, 'Jagan', 300)SQL>/ Enter value for no: 2Enter value for name: NarenEnter value for marks: 400old   1: insert into student values(&no, '&name', &marks)new   1: insert into student values(2, 'Naren', 400)c) INSERTING DATA INTO SPECIFIED COLUMNS USING VALUE METHOD  Syntax: insert into <table_name)(col1, col2, col3 … Coln) values (value1, value2, value3 …. Valuen);3Ex:  SQL>insert into student (no, name) values (3, ’Ramesh’);SQL>insert into student (no, name) values (4, ’Madhu’);d) INSERTING DATA INTO SPECIFIED COLUMNS USING ADDRESS METHODSyntax: insert into <table_name)(col1, col2, col3 … coln) values (&col1, &col2, &col3 …. &coln);This will prompt you for the values but for every insert you have to use forward slash. Ex:SQL>insert into student (no, name) values (&no, '&name'); Enter value for no: 5Enter value for name: Visu old   1:  insert into student (no, name) values(&no, '&name') new   1:  insert into student (no, name) values(5, 'Visu')SQL>/ Enter value for no: 6Enter value for name: Rattu old   1:  insert into student (no, name) values(&no, '&name') new   1:  insert into student (no, name) values(6, 'Rattu')SELECTING DATASyntax: Select * from <table_name>; -- here * indicates all columns orSelect col1, col2, … coln from <table_name>;Ex: SQL>select * from student;         NO NAME      MARKS         --- ------ --------4         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh 4   Madhu         5   Visu          6   Rattu SQL>select no, name, marks from student;        NO NAME            MARKS         --- ------ --------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL>select no, name from student;        NO NAME         --- -------         1   Sudha         2   Saketh          1   Jagan         2   Naren         3   Ramesh          4   Madhu          5   Visu          6   Rattu 5CONDITIONAL SELECTIONS AND OPERATORS We have two clauses used in thisWhere Order byUSING WHERE  Syntax: select * from <table_name> where <condition>;the following are the different types of operators used in where clause. Arithmetic operators  Comparison operators Logical operators   Arithmetic operators -- highest precedence+, -, *, / Comparison operators =, !=, >, <, >=, <=, <>between, not betweenin, not innull, not nulllike  Logical operators And Or   -- lowest precedencenot a) USING =, >, <, >=, <=, !=, <> Ex:SQL>select * from student where no = 2; 6NO NAME            MARKS  ---  -------           --------- 2   Saketh            200 2   Naren             400 SQL>select * from student where no < 2;NO NAME            MARKS---  -------           ----------1   Sudha             100 1   Jagan             300 SQL>select * from student where no > 2;          NO NAME            MARKS         ---  -------           ----------          3   Ramesh          4   Madhu          5   Visu          6   Rattu  SQL> select * from student where no <= 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren 400 SQL> select * from student where no >= 2;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            2007         2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no != 2;         NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan             300          3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no <> 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan          300          3   Ramesh          4   Madhu          5   Visu          6   Rattu b) USING AND This will gives the output when all the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> and .. <conditionn>; 8Ex:SQL> select * from student where no = 2 and marks >= 200;NO NAME            MARKS         ---  -------           --------          2   Saketh            200         2   Naren             400c) USING ORThis will gives the output when either of the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> or .. <conditionn>;Ex: SQL> select * from student where no = 2 or marks >= 200;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan             300          2   Naren             400d) USING BETWEEN This will gives the output based on the column and its lower bound, upperbound.Syntax: select * from <table_name> where <col> between <lower bound> and <upper bound>; Ex: SQL> select * from student where marks between 200 and 400; 9         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan              300 2   Naren              400e) USING NOT BETWEEN This will gives the output based on the column which values are not in its lower bound, upperbound. Syntax: select * from <table_name> where <col> not between <lower bound> and <upper bound>;Ex: SQL> select * from student where marks not between 200 and 400;         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100  f) USING INThis will gives the output based on the column and its list of values specified.Syntax: select * from <table_name> where <col> in (value1, value2, value3 … valuen);Ex: SQL> select * from student where no in (1, 2, 3);          NO NAME            MARKS         --- ------- ---------         1   Sudha             100 10         2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh g) USING NOT INThis will gives the output  based on the column which values are not in the list of values  specified. Syntax: select * from <table_name> where <col> not in ( value1, value2, value3 … valuen); Ex: SQL> select * from student where no not in (1, 2, 3);           NO NAME            MARKS         ---  -------           ---------         4   Madhu          5   Visu          6   Rattu  h) USING NULLThis will gives the output based on the null values in the specified column. Syntax: select * from <table_name> where <col> is null; Ex: SQL> select * from student where marks is null;         NO NAME            MARKS         ---  -------           ---------         3   Ramesh 11         4   Madhu          5   Visu          6   Rattu  i) USING NOT NULLThis will gives the output based on the not null values in the specified column.Syntax: select * from <table_name> where <col> is not null; Ex:SQL> select * from student where marks is not null;          NO NAME            MARKS         ---  -------           ---------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400 j) USING LIKE This will be used to search through the rows of database column based on the pattern you  specify.Syntax: select * from <table_name> where <col> like <pattern>; Ex:i) This will give the rows whose marks are 100. SQL>select * from student where marks like 100;          NO NAME            MARKS         ---  -------           ---------12         1   Sudha             100  ii) This will give the rows whose name start with ‘S’.  SQL>select * from student where name like 'S%';         NO NAME            MARKS         ---  -------    ---------         1   Sudha             100          2   Saketh            200iii) This will give the rows whose name ends with ‘h’. SQL>select * from student where name like '%h';           NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh  iV) This will give the rows whose name’s second letter start with ‘a’.SQL>select * from student where name like '_a%';         NO NAME            MARKS           --- -------            --------          2   Saketh            200          1   Jagan             300           2   Naren             400          3   Ramesh           4   Madhu           6   Rattu V) This will give the rows whose name’s third letter start with ‘d’. 13SQL>select * from student where name like '__d%';         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100 4   MadhuVi) This will give the rows whose name’s second letter start with ‘t’ from ending.SQL>select * from student where name like '%_t%';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         6   Rattu  Vii) This will give the rows whose name’s third letter start with ‘e’ from ending. SQL>select * from student where name like '%e__%';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh Viii) This will give the rows whose name  cotains 2 a’s.SQL>select * from student where name like '%a% a %';         NO NAME            MARKS          --- -------           ----------          1   Jagan             300 * You have to specify the patterns in like using underscore ( _ ).14USING ORDER BY This will be used to ordering the columns data (ascending or descending). Syntax: Select * from <table_name> order by <col> desc;By default oracle will use ascending order. If you want output in descending order you have to use desc keyword after the column. Ex: SQL>select * from student order by no;NO NAME            MARKS---  -------           --------- 1   Sudha             100 1   Jagan              300 2   Saketh            200 2   Naren             4003   Ramesh4   Madhu 5   Visu    6   RattuSQL>select * from student order by no desc; NO NAME            MARKS---  -------           --------- 6 Rattu 5 Visu 4 Madhu 3 Ramesh 2 Saketh            2002 Naren             400 1 Sudha             100 1 Jagan             300 15USING DML  USING UPDATEThis can be used to modify the table data. Syntax: Update <table_name> set <col1> = value1, <col2> = value2 where <condition>;Ex: SQL>update student set marks = 500;If you are not specifying any condition this will update entire table.SQL>update student set marks = 500 where no = 2;SQL>update student set marks = 500, name = 'Venu' where no = 1; USING DELETE This can be used to delete the table data temporarily.Syntax: Delete <table_name> where <condition>; Ex: SQL>delete student;If you are not specifying any condition this will delete entire table. SQL>delete student where no = 2; 16USING DDLUSING ALTERThis can be used to add or remove columns and to modify the precision of the datatype. a) ADDING COLUMN Syntax: alter table <table_name> add <col datatype>;Ex: SQL>alter table student add sdob date;  b) REMOVING COLUMNSyntax: alter table <table_name> drop <col datatype>; Ex: SQL> alter table student drop column sdob; c) INCREASING OR DECREASING PRECISION OF A COLUMNSyntax: alter table <table_name> modify <col datatype>;Ex: SQL>alter table student modify marks number(5);* To decrease precision the column should be empty.d) MAKING COLUMN UNUSEDSyntax: alter table <table_name> set unused column <col>;17Ex: SQL> alter table student set unused column marks; Even though the column is unused still it will occupy memory.d) DROPPING UNUSED COLUMNSSyntax: alter table <table_name> drop unused columns;Ex: SQL>alter table student drop unused columns;   * You can not drop individual unused columns of a table. e) RENAMING COLUMN Syntax: alter table <table_name> rename column <old_col_name> to <new_col_name>;Ex: SQL>alter table student rename column marks to smarks;  USING TRUNCATEThis can be used to delete the entire table data permanently. Syntax: truncate table <table_name>;Ex: SQL>truncate table student; USING DROP  This will be used to drop the database object; 18Syntax: Drop table <table_name>;Ex: SQL>drop table student;USING RENAME This will be used to rename the database object;Syntax: rename <old_table_name> to <new_table_name>;Ex: SQL>rename student to stud;19USING TCLUSING COMMITThis will be used to save the work.Commit is of two types. ImplicitExplicit a) IMPLICIT  This will be issued by oracle internally in two situations.When any DDL operation is performed. When you are exiting from SQL * PLUS. b) EXPLICITThis will be issued by the user. Syntax:  Commit or commit work;* When ever you committed then the transaction was completed.USING ROLLBACK This will undo the operation.This will be applied in two methods. Upto previous commitUpto previous rollback Syntax: Roll or roll work; Or  Rollback or rollback work;* While process is going on, if suddenly power goes then oracle will rollback the transaction. 20USING SAVEPOINT You can use savepoints to rollback portions of your current set of transactions. Syntax: Savepoint <savepoint_name>;Ex: SQL>savepoint s1;SQL>insert into student values(1, ‘a’, 100); SQL>savepoint s2;SQL>insert into student values(2, ‘b’, 200); SQL>savepoint s3;SQL> insert into student values(3, ‘c’, 300); SQL>savepoint s4;SQL> insert into student values(4, ‘d’, 400); Before rollback SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100          2  b         200         3  c         300          4  d         400SQL>rollback to savepoint s3;  Or SQL>rollback to s3;  This will rollback last two records. 21SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100 2 b         20022USING DCLDCL commands are used to granting and revoking the permissions. USING GRANTThis is used to grant the privileges to other users.Syntax: Grant <privileges> on <object_name> to <user_name> [with grant option]; Ex: SQL>grant select on student to sudha;-- you can give individual privilege SQL> grant select, insert on student to sudha; -- you can give set of privilegesSQL>grant all on student to sudha;  -- you can give all privileges  The sudha user has to use dot method to access the object.SQL>select * from saketh.student; The sudha user can not grant permission on student table to other users. To get this type of option use the following.SQL>grant all on student to sudha with grant option;  Now sudha user also grant permissions on student table. USING REVOKEThis is used to revoke the privileges from the users to which you granted the privileges. Syntax: Revoke <privileges> on <object_name> from <user_name>; Ex: SQL>revoke select on student form sudha; -- you can revoke individual privilegeSQL>revoke select, insert on student from sudha;-- you can revoke set of privilegesSQL> revoke all on student from sudha; -- you can revoke all privileges 23USING ALIASESCREATE WITH SELECT We can create a table using existing table [along with data].Syntax: Create table <new_table_name> [col1, col2, col3 ... coln] as select * from  <old_table_name>;Ex: SQL>create table student1 as select * from student; Creating table with your own column names.SQL>create table student2(sno, sname, smarks) as select * from student; Creating table with specified columns.SQL>create table student3 as select no,name from student;  Creating table with out table data. SQL>create table student2(sno, sname, smarks) as select * from student where 1 = 2; In the above where clause give any condition which does not satisfy. INSERT WITH SELECTUsing this we can insert existing table data to a another table in a single trip. But the table structure should be same. Syntax: Insert into <table1> select * from <table2>;     Ex: SQL>insert into student1 select * from student;Inserting data into specified columnsSQL>insert into student1(no, name) select no, name from student;24COLUMN ALIASES Syntax: Select <orginal_col> <alias_name> from <table_name>;Ex:SQL>select no sno from student;orSQL>select no “sno” from student;TABLE ALIASES If you are using table aliases you can use dot method to the columns. Syntax: Select <alias_name>.<col1>, <alias_name>.<col2> … <alias_name>.<coln> from <table_name> <alias_name>; Ex: SQL>select s.no, s.name from student s;25USING MERGEMERGE You can use merge command to perform insert and update in a single command. Ex: SQL>Merge into student1 s1 Using (select *From student2) s2 On(s1.no=s2.no)When matched then Update set marks = s2.marksWhen not matched thenInsert (s1.no,s1.name,s1.marks) Values(s2.no,s2.name,s2.marks); In the above the two tables are with the same structure but we can merge different structured     tables also but the datatype of the columns should match.Assume that student1 has columns like no,name,marks and student2 has columns like no,        name, hno, city. SQL>Merge into student1 s1 Using (select *From student2) s2 On(s1.no=s2.no)When matched then Update set marks = s2.hno When not matched thenInsert (s1.no,s1.name,s1.marks) Values(s2.no,s2.name,s2.hno);26MULTIBLE INSERTSWe have table called DEPT with the following columns and dataDEPTNO DNAME LOC -------- -------- ----10 accounting new york 20 research dallas30 sales   Chicago 40 operations bostona) CREATE STUDENT TABLE SQL>Create table student(no number(2),name varchar(2),marks number(3)); b) MULTI INSERT WITH ALL FIELDS SQL>Insert all Into student values(1,’a’,100)Into student values(2,’b’,200) Into student values(3,’c’,300) Select *from dept where deptno=10;-- This inserts 3 rows c) MULTI INSERT WITH SPECIFIED FIELDSSQL>insert all Into student (no,name) values(4,’d’)Into student(name,marks) values(’e’,400)Into student values(3,’c’,300) Select *from dept where deptno=10;-- This inserts 3 rows 27d) MULTI INSERT WITH DUPLICATE ROWSSQL>insert all Into student values(1,’a’,100)Into student values(2,’b’,200) Into student values(3,’c’,300) Select *from dept where deptno > 10;-- This inserts 9 rows because in the select statement retrieves 3 records (3 inserts for each     row retrieved)e) MULTI INSERT WITH CONDITIONS BASEDSQL>Insert all When deptno > 10 thenInto student1 values(1,’a’,100)When dname = ‘SALES’ then Into student2 values(2,’b’,200)When loc = ‘NEW  YORK’ then Into student3 values(3,’c’,300) Select *from dept where deptno>10;-- This  inserts 4 rows because the first condition satis

In [24]:
type(document_ques_gen[0])

langchain_core.documents.base.Document

**for using tokentextsplitter data must be in document**

In [25]:
splitter_ques_gen = TokenTextSplitter(
    model_name ="gpt-3.5-turbo",
    chunk_size =10000,
    chunk_overlap = 100
)

In [27]:
document_answer_gen = splitter_ques_gen.split_documents(
    document_ques_gen   
)

In [28]:
document_answer_gen

[Document(page_content="1INTRODUCTION SQL is divided into the followingData Definition Language (DDL) Data Manipulation Language (DML) Data Retrieval Language (DRL) Transaction Control Language (TCL) Data Control Language (DCL)DDL-- create, alter, drop, truncate, renameDML -- insert, update, delete  DRL -- selectTCL -- commit, rollback, savepointDCL-- grant, revoke  CREATE TABLE SYNTAX Create table <table_name> (col1 datatype1, col2 datatype2 …coln datatypen); Ex: SQL>create table student (no number (2), name varchar (10), marks number (3));INSERT This will be used to insert the records into table.We have two methods to insert. By value method By address methoda) USING VALUE METHOD  Syntax: insert into <table_name) values (value1, value2, value3 …. Valuen);  2Ex:  SQL>insert into student values (1, ’sudha’, 100); SQL>insert into student values (2, ’saketh’, 200); To insert a new record again you have to type entire insert command, if there are lot of  records this will be difficult.This will be avoided by using address method. b) USING ADDRESS METHOD Syntax: insert into <table_name) values (&col1, &col2, &col3 …. &coln); This will prompt you for the values but for every insert you have to use forward slash. Ex: SQL>insert into student values (&no, '&name', &marks); Enter value for no: 1Enter value for name: Jagan Enter value for marks: 300old   1: insert into student values(&no, '&name', &marks)new   1: insert into student values(1, 'Jagan', 300)SQL>/ Enter value for no: 2Enter value for name: NarenEnter value for marks: 400old   1: insert into student values(&no, '&name', &marks)new   1: insert into student values(2, 'Naren', 400)c) INSERTING DATA INTO SPECIFIED COLUMNS USING VALUE METHOD  Syntax: insert into <table_name)(col1, col2, col3 … Coln) values (value1, value2, value3 …. Valuen);3Ex:  SQL>insert into student (no, name) values (3, ’Ramesh’);SQL>insert into student (no, name) values (4, ’Madhu’);d) INSERTING DATA INTO SPECIFIED COLUMNS USING ADDRESS METHODSyntax: insert into <table_name)(col1, col2, col3 … coln) values (&col1, &col2, &col3 …. &coln);This will prompt you for the values but for every insert you have to use forward slash. Ex:SQL>insert into student (no, name) values (&no, '&name'); Enter value for no: 5Enter value for name: Visu old   1:  insert into student (no, name) values(&no, '&name') new   1:  insert into student (no, name) values(5, 'Visu')SQL>/ Enter value for no: 6Enter value for name: Rattu old   1:  insert into student (no, name) values(&no, '&name') new   1:  insert into student (no, name) values(6, 'Rattu')SELECTING DATASyntax: Select * from <table_name>; -- here * indicates all columns orSelect col1, col2, … coln from <table_name>;Ex: SQL>select * from student;         NO NAME      MARKS         --- ------ --------4         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh 4   Madhu         5   Visu          6   Rattu SQL>select no, name, marks from student;        NO NAME            MARKS         --- ------ --------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL>select no, name from student;        NO NAME         --- -------         1   Sudha         2   Saketh          1   Jagan         2   Naren         3   Ramesh          4   Madhu          5   Visu          6   Rattu 5CONDITIONAL SELECTIONS AND OPERATORS We have two clauses used in thisWhere Order byUSING WHERE  Syntax: select * from <table_name> where <condition>;the following are the different types of operators used in where clause. Arithmetic operators  Comparison operators Logical operators   Arithmetic operators -- highest precedence+, -, *, / Comparison operators =, !=, >, <, >=, <=, <>between, not betweenin, not innull, not nulllike  Logical operators And Or   -- lowest precedencenot a) USING =, >, <, >=, <=, !=, <> Ex:SQL>select * from student where no = 2; 6NO NAME            MARKS  ---  -------           --------- 2   Saketh            200 2   Naren             400 SQL>select * from student where no < 2;NO NAME            MARKS---  -------           ----------1   Sudha             100 1   Jagan             300 SQL>select * from student where no > 2;          NO NAME            MARKS         ---  -------           ----------          3   Ramesh          4   Madhu          5   Visu          6   Rattu  SQL> select * from student where no <= 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren 400 SQL> select * from student where no >= 2;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            2007         2   Naren             400         3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no != 2;         NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan             300          3   Ramesh          4   Madhu          5   Visu          6   Rattu SQL> select * from student where no <> 2;          NO NAME            MARKS         ---  -------           ----------          1   Sudha             100          1   Jagan          300          3   Ramesh          4   Madhu          5   Visu          6   Rattu b) USING AND This will gives the output when all the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> and .. <conditionn>; 8Ex:SQL> select * from student where no = 2 and marks >= 200;NO NAME            MARKS         ---  -------           --------          2   Saketh            200         2   Naren             400c) USING ORThis will gives the output when either of the conditions become true. Syntax: select * from <table_name> where <condition1> and <condition2> or .. <conditionn>;Ex: SQL> select * from student where no = 2 or marks >= 200;          NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan             300          2   Naren             400d) USING BETWEEN This will gives the output based on the column and its lower bound, upperbound.Syntax: select * from <table_name> where <col> between <lower bound> and <upper bound>; Ex: SQL> select * from student where marks between 200 and 400; 9         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         1   Jagan              300 2   Naren              400e) USING NOT BETWEEN This will gives the output based on the column which values are not in its lower bound, upperbound. Syntax: select * from <table_name> where <col> not between <lower bound> and <upper bound>;Ex: SQL> select * from student where marks not between 200 and 400;         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100  f) USING INThis will gives the output based on the column and its list of values specified.Syntax: select * from <table_name> where <col> in (value1, value2, value3 … valuen);Ex: SQL> select * from student where no in (1, 2, 3);          NO NAME            MARKS         --- ------- ---------         1   Sudha             100 10         2   Saketh            200         1   Jagan             300          2   Naren             400         3   Ramesh g) USING NOT INThis will gives the output  based on the column which values are not in the list of values  specified. Syntax: select * from <table_name> where <col> not in ( value1, value2, value3 … valuen); Ex: SQL> select * from student where no not in (1, 2, 3);           NO NAME            MARKS         ---  -------           ---------         4   Madhu          5   Visu          6   Rattu  h) USING NULLThis will gives the output based on the null values in the specified column. Syntax: select * from <table_name> where <col> is null; Ex: SQL> select * from student where marks is null;         NO NAME            MARKS         ---  -------           ---------         3   Ramesh 11         4   Madhu          5   Visu          6   Rattu  i) USING NOT NULLThis will gives the output based on the not null values in the specified column.Syntax: select * from <table_name> where <col> is not null; Ex:SQL> select * from student where marks is not null;          NO NAME            MARKS         ---  -------           ---------         1   Sudha             100          2   Saketh            200         1   Jagan             300          2   Naren             400 j) USING LIKE This will be used to search through the rows of database column based on the pattern you  specify.Syntax: select * from <table_name> where <col> like <pattern>; Ex:i) This will give the rows whose marks are 100. SQL>select * from student where marks like 100;          NO NAME            MARKS         ---  -------           ---------12         1   Sudha             100  ii) This will give the rows whose name start with ‘S’.  SQL>select * from student where name like 'S%';         NO NAME            MARKS         ---  -------    ---------         1   Sudha             100          2   Saketh            200iii) This will give the rows whose name ends with ‘h’. SQL>select * from student where name like '%h';           NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh  iV) This will give the rows whose name’s second letter start with ‘a’.SQL>select * from student where name like '_a%';         NO NAME            MARKS           --- -------            --------          2   Saketh            200          1   Jagan             300           2   Naren             400          3   Ramesh           4   Madhu           6   Rattu V) This will give the rows whose name’s third letter start with ‘d’. 13SQL>select * from student where name like '__d%';         NO NAME            MARKS         ---  -------           ---------         1   Sudha             100 4   MadhuVi) This will give the rows whose name’s second letter start with ‘t’ from ending.SQL>select * from student where name like '%_t%';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         6   Rattu  Vii) This will give the rows whose name’s third letter start with ‘e’ from ending. SQL>select * from student where name like '%e__%';         NO NAME            MARKS         ---  -------           ---------         2   Saketh            200         3   Ramesh Viii) This will give the rows whose name  cotains 2 a’s.SQL>select * from student where name like '%a% a %';         NO NAME            MARKS          --- -------           ----------          1   Jagan             300 * You have to specify the patterns in like using underscore ( _ ).14USING ORDER BY This will be used to ordering the columns data (ascending or descending). Syntax: Select * from <table_name> order by <col> desc;By default oracle will use ascending order. If you want output in descending order you have to use desc keyword after the column. Ex: SQL>select * from student order by no;NO NAME            MARKS---  -------           --------- 1   Sudha             100 1   Jagan              300 2   Saketh            200 2   Naren             4003   Ramesh4   Madhu 5   Visu    6   RattuSQL>select * from student order by no desc; NO NAME            MARKS---  -------           --------- 6 Rattu 5 Visu 4 Madhu 3 Ramesh 2 Saketh            2002 Naren             400 1 Sudha             100 1 Jagan             300 15USING DML  USING UPDATEThis can be used to modify the table data. Syntax: Update <table_name> set <col1> = value1, <col2> = value2 where <condition>;Ex: SQL>update student set marks = 500;If you are not specifying any condition this will update entire table.SQL>update student set marks = 500 where no = 2;SQL>update student set marks = 500, name = 'Venu' where no = 1; USING DELETE This can be used to delete the table data temporarily.Syntax: Delete <table_name> where <condition>; Ex: SQL>delete student;If you are not specifying any condition this will delete entire table. SQL>delete student where no = 2; 16USING DDLUSING ALTERThis can be used to add or remove columns and to modify the precision of the datatype. a) ADDING COLUMN Syntax: alter table <table_name> add <col datatype>;Ex: SQL>alter table student add sdob date;  b) REMOVING COLUMNSyntax: alter table <table_name> drop <col datatype>; Ex: SQL> alter table student drop column sdob; c) INCREASING OR DECREASING PRECISION OF A COLUMNSyntax: alter table <table_name> modify <col datatype>;Ex: SQL>alter table student modify marks number(5);* To decrease precision the column should be empty.d) MAKING COLUMN UNUSEDSyntax: alter table <table_name> set unused column <col>;17Ex: SQL> alter table student set unused column marks; Even though the column is unused still it will occupy memory.d) DROPPING UNUSED COLUMNSSyntax: alter table <table_name> drop unused columns;Ex: SQL>alter table student drop unused columns;   * You can not drop individual unused columns of a table. e) RENAMING COLUMN Syntax: alter table <table_name> rename column <old_col_name> to <new_col_name>;Ex: SQL>alter table student rename column marks to smarks;  USING TRUNCATEThis can be used to delete the entire table data permanently. Syntax: truncate table <table_name>;Ex: SQL>truncate table student; USING DROP  This will be used to drop the database object; 18Syntax: Drop table <table_name>;Ex: SQL>drop table student;USING RENAME This will be used to rename the database object;Syntax: rename <old_table_name> to <new_table_name>;Ex: SQL>rename student to stud;19USING TCLUSING COMMITThis will be used to save the work.Commit is of two types. ImplicitExplicit a) IMPLICIT  This will be issued by oracle internally in two situations.When any DDL operation is performed. When you are exiting from SQL * PLUS. b) EXPLICITThis will be issued by the user. Syntax:  Commit or commit work;* When ever you committed then the transaction was completed.USING ROLLBACK This will undo the operation.This will be applied in two methods. Upto previous commitUpto previous rollback Syntax: Roll or roll work; Or  Rollback or rollback work;* While process is going on, if suddenly power goes then oracle will rollback the transaction. 20USING SAVEPOINT You can use savepoints to rollback portions of your current set of transactions. Syntax: Savepoint <savepoint_name>;Ex: SQL>savepoint s1;SQL>insert into student values(1, ‘a’, 100); SQL>savepoint s2;SQL>insert into student values(2, ‘b’, 200); SQL>savepoint s3;SQL> insert into student values(3, ‘c’, 300); SQL>savepoint s4;SQL> insert into student values(4, ‘d’, 400); Before rollback SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100          2  b         200         3  c         300          4  d         400SQL>rollback to savepoint s3;  Or SQL>rollback to s3;  This will rollback last two records. 21SQL>select * from student;        NO NAME      MARKS        --- ------- ----------         1  a         100 2 b         20022USING DCLDCL commands are used to granting and revoking the permissions. USING GRANTThis is used to grant the privileges to other users.Syntax: Grant <privileges> on <object_name> to <user_name> [with grant option]; Ex: SQL>grant select on student to sudha;-- you can give individual privilege SQL> grant select, insert on student to sudha; -- you can give set of privilegesSQL>grant all on student to sudha;  -- you can give all privileges  The sudha user has to use dot method to access the object.SQL>select * from saketh.student; The sudha user can not grant permission on student table to other users. To get this type of option use the following.SQL>grant all on student to sudha with grant option;  Now sudha user also grant permissions on student table. USING REVOKEThis is used to revoke the privileges from the users to which you granted the privileges. Syntax: Revoke <privileges> on <object_name> from <user_name>; Ex: SQL>revoke select on student form sudha; -- you can revoke individual privilegeSQL>revoke select, insert on student from sudha;-- you can revoke set of privilegesSQL> revoke all on student from sudha; -- you can revoke all privileges 23USING ALIASESCREATE WITH SELECT We can create a table using existing table [along with data].Syntax: Create table <new_table_name> [col1, col2, col3 ... coln] as select * from  <old_table_name>;Ex: SQL>create table student1 as select * from student; Creating table with your own column names.SQL>create table student2(sno, sname, smarks) as select * from student; Creating table with specified columns.SQL>create table student3 as select no,name from student;  Creating table with out table data. SQL>create table student2(sno, sname, smarks) as select * from student where 1 = 2; In the above where clause give any condition which does not satisfy. INSERT WITH SELECTUsing this we can insert existing table data to a another table in a single trip. But the table structure should be same. Syntax: Insert into <table1> select * from <table2>;     Ex: SQL>insert into student1 select * from student;Inserting data into specified columnsSQL>insert into student1(no, name) select no, name from student;24COLUMN ALIASES Syntax: Select <orginal_col> <alias_name> from <table_name>;Ex:SQL>select no sno from student;orSQL>select no “sno” from student;TABLE ALIASES If you are using table aliases you can use dot method to the columns. Syntax: Select <alias_name>.<col1>, <alias_name>.<col2> … <alias_name>.<coln> from <table_name> <alias_name>; Ex: SQL>select s.no, s.name from student s;25USING MERGEMERGE You can use merge command to perform insert and update in a single command. Ex: SQL>Merge into student1 s1 Using (select *From student2) s2 On(s1.no=s2.no)When matched then Update set marks = s2.marksWhen not matched thenInsert (s1.no,s1.name,s1.marks) Values(s2.no,s2.name,s2.marks); In the above the two tables are with the same structure but we can merge different structured     tables also but the datatype of the columns should match.Assume that student1 has columns like no,name,marks and student2 has columns like no,        name, hno, city. SQL>Merge into student1 s1 Using (select *From student2) s2 On(s1.no=s2.no)When matched then Update set marks = s2.hno When not matched thenInsert (s1.no,s1.name,s1.marks) Values(s2.no,s2.name,s2.hno);26MULTIBLE INSERTSWe have table called DEPT with the following columns and dataDEPTNO DNAME LOC -------- -------- ----10 accounting new york 20 research dallas30 sales   Chicago 40 operations bostona) CREATE STUDENT TABLE SQL>Create table student(no number(2),name varchar(2),marks number(3)); b) MULTI INSERT WITH ALL FIELDS SQL>Insert all Into student values(1,’a’,100)Into student values(2,’b’,200) Into student values(3,’c’,300) Select *from dept where deptno=10;-- This inserts 3 rows c) MULTI INSERT WITH SPECIFIED FIELDSSQL>insert all Into student (no,name) values(4,’d’)Into student(name,marks) values(’e’,400)Into student values(3,’c’,300) Select *from dept where deptno=10;-- This inserts 3 rows 27d) MULTI INSERT WITH DUPLICATE ROWSSQL>insert all Into student values(1,’a’,100)Into student values(2,’b’,200) Into student values(3,’c’,300) Select *from dept where deptno > 10;-- This inserts 9 rows because in the select statement retrieves 3 records (3 inserts for each     row retrieved)e) MULTI INSERT WITH CONDITIONS BASEDSQL>Insert all When deptno > 10 thenInto student1 values(1,’a’,100)When dname = ‘SALES’ then Into student2 values(2,’b’,200)When loc = ‘NEW  YORK’ then Into student3 values(3,’c’,300) Select *from dept where deptno>10;-- This  inserts 4 rows because the first condition satis

In [29]:
len(document_answer_gen)

4

**chunking is done**

# Defien LLm

In [39]:
from langchain.chat_models import ChatOpenAI

In [ ]:
llm_ques_gen_pipeline = ChatOpenAI(
    model = "gpt-3.5-turbo",
    tempreture = 0.3
)

define Prompt

In [42]:
prompt_template = """
You are an expert at creating questions based on coding materials and documentation.
Your goal is to prepare a coder or programmer for their exam and coding tests.
You do this by asking questions about the text below:

------------
{text}
------------

Create questions that will prepare the coders or programmers for their tests.
Make sure not to lose any important information.

QUESTIONS:
"""

In [43]:
from langchain.prompts import PromptTemplate

In [45]:
PROMPT_QUESTION = PromptTemplate(template  = prompt_template, input_variables= ["text"])

**fro validate prompt we have to use refine Prompt for better Prompt**

In [46]:
refine_template = ("""
You are an expert at creating practice questions based on coding material and documentation.
Your goal is to help a coder or programmer prepare for a coding test.
We have received some practice questions to a certain extent: {existing_answer}.
We have the option to refine the existing questions or add new ones.
(only if necessary) with some more context below.
------------
{text}
------------

Given the new context, refine the original questions in English.
If the context is not helpful, please provide the original questions.
QUESTIONS:
"""
)

In [47]:
REFINE_PROMPT_TEMPLATE = PromptTemplate(
    template = refine_template,
    input_variables = ["text", "existing_answer"]
    )

**from getting question the we have to intregated llm model with prompt then we use**

In [48]:
from langchain.chains.summarize import load_summarize_chain

In [ ]:
ques_gen_chain = load_summarize_chain(llm_ques_gen_pipeline,
                                      chain_type ="refine",
                                      verbose = True,
                                      question_prompt = PROMPT_QUESTION,
                                      refine_prompt = REFINE_PROMPT_TEMPLATE)

In [ ]:
ques = ques_gen_chain.run(document_ques_gen)

print(ques)

its give all 10 question on pdf based

# **EMBEDDING**

In [50]:
from langchain.embeddings.openai import OpenAIEmbeddings

In [ ]:
embeddings = OpenAIEmbeddings()

define vector database

faiss is faster than chroma db

In [52]:
from langchain.vectorstores import FAISS

In [ ]:
vector_store = FAISS.from_documents(document_answer_gen, embeddings)

In [ ]:
# again define llm model

llm_answer_gen = ChatOpenAI(tempereature = 0.1, model = "gpt-3.5-turbo")

In [ ]:
ques

show line by line

In [ ]:
ques_list = ques.split("\n")

# **question-answer chain**

In [57]:
from langchain.chains import RetrievalQA

In [ ]:
answer_generation_chain = RetrievalQA.from_chain_type(llm =llm_answer_gen,
                                                      chain_type = "stuff",
                                                      retriever = vector_store.as_retriever())

In [ ]:
# Answer each question and save to a file

for question in ques_list:
    print("Question: ", question)
    answer = answer_generation_chain.run(question)
    print("Answer :", answer)
    print("------------------------------------------------------\\n\\n")

    # Save answer to file

    with open("answer.txt", "a") as f:
        f.write("Question: " + question + "\\n")
        f.write("Answer: " + answer + "\\n")
        f.write("------------------------------------------------------\\n\\n")

**ye answer.txt file banayenga or vha questio and answer savve karenga**